List<Map<String, dynamic>> cars = [
  {
    "img": "assets/car0.jpg",
    "name": "Morning",
    "type": "Light car",
    "description": "모닝은 기아자동차에서 제조 및 판매하는 경차입니다. 작고 경제적인 이 차량은 도심 주행과 주차에 탁월한 선택으로, 특히 연료 효율이 뛰어나 장거리 운전에서도 경제적입니다. 모닝은 콤팩트한 크기에도 불구하고 넓은 실내 공간을 제공하여 작은 가족이나 도시 생활을 하는 개인에게 적합합니다. 현대적인 디자인과 첨단 기술을 갖춘 모닝은 안전성과 편의성을 모두 고려한 차량으로, 합리적인 가격대로 많은 소비자에게 사랑받고 있습니다."
  },
  {
    "img": "assets/car1.jpg",
    "name": "Ray",
    "type": "Light car",
    "description": "레이는 경차 카테고리에 속하는 기아자동차의 모델로, 독특한 박스형 디자인이 특징입니다. 레이는 넓은 실내 공간과 높은 연료 효율성을 자랑하며, 작은 크기로 인한 뛰어난 기동성으로 좁은 도시 거리에서 운전하기 적합합니다."
  },
  {
    "img": "assets/car2.png",
    "name": "Grandeur",
    "type": "General car",
    "description": "그랜저는 현대자동차에서 제조하는 대형 세단 차량으로, 고급스러운 디자인과 편안한 승차감을 제공합니다. 넓은 실내 공간과 다양한 안전 및 편의 기능을 갖춘 그랜저는 비즈니스 및 가족용 차량으로 인기가 높습니다."
  },
  {
    "img": "assets/car3.jpg",
    "name": "Zeep",
    "type": "General car",
    "description": "지프는 견고한 오프로드 성능과 튼튼한 디자인을 자랑하는 차량으로 알려져 있습니다. 모험과 야외 활동을 즐기는 운전자에게 적합한 지프는 다양한 지형에서의 운전을 즐길 수 있게 해줍니다."
  },
  {
    "img": "assets/car4.jpg",
    "name": "Poter",
    "type": "Van",
    "description": "포터는 현대자동차에서 제조하는 소형 트럭으로, 다목적 화물 운송에 적합합니다. 실용적인 디자인과 높은 내구성으로 소규모 사업자 및 상업 용도로 많이 사용됩니다."
  },
  {
    "img": "assets/car5.jpg",
    "name": "Starrex",
    "type": "Van",
    "description": "스타렉스는 현대자동차에서 생산하는 다목적 차량으로, 넓은 실내 공간과 다용도 성능이 특징입니다. 가족 여행 및 상업적 화물 운송에 모두 적합하며, 다양한 구성 옵션을 제공합니다."
  },
  {
    "img": "assets/car6.png",
    "name": "Buildcar",
    "type": "Construction vehicle",
    "description": "Buildcar는 건설 현장에서 활용되는 건설용 차량입니다. 견고한 구조와 강력한 엔진으로 무거운 재료의 운반 및 이동이 필요한 작업에 주로 사용됩니다. 빌드카는 효율적인 건설 작업을 가능하게 하는 다양한 부착 장비를 장착할 수 있어 건설 현장의 필수 차량으로 자리잡고 있습니다."
  },
];